[
  {
    "version": "1.11.0",
    "date": "2022-07-12",
    "items": [
      {
        "type": "new",
        "title": "Daten Synchronisierung",
        "text": "GridScore kann jetzt Daten von verschiedenen Geräten im gleichen Versuch synchronisieren. Daten werden priorisiert nach dem neuesten Änderungsdatum."
      },
      {
        "type": "new",
        "title": "Germinate-Export",
        "text": "Beim Exportieren von Daten in Germinate Datenvorlagen die Mehrfachmerkmale enthalten muss eine Aggregierungsmethode pro Merkmal gewählt werden."
      },
      {
        "type": "new",
        "title": "Studien",
        "text": "GridScore unterstützt jetzt einen weiteren Typen an Datensatz: Studien. Diese sind für die freie Sammlung von Daten geeignet die sich nicht an eine Rasteranordnung halten."
      },
      {
        "type": "new",
        "title": "Datensatzkommentare",
        "text": "Es ist jetzt möglich allgemeine Kommentare zum gesamten Versuch hinzuzufügen. Dazu wird das kleine Kommentar-Symbol neben dem Versuchsnamen auf dem Datenbildschirm genutzt."
      },
      {
        "type": "update",
        "title": "Datenkreise",
        "text": "Die Merkmalskreise für Mehrfachmerkmale zeigen nun einen half-gefüllten Kreis wenn ein Mehrfachmerkmal mindestens einmal bewertet wurde."
      },
      {
        "type": "bugfix",
        "title": "Sprachsynthese",
        "text": "Behebt einen Fehler bei der Sprachsynthese wo in bestimmten Fällen Text verloren geht."
      }
    ]
  }, {
    "version": "1.12.0",
    "date": "2022-08-12",
    "items": [
      {
        "type": "new",
        "title": "Einzel-Merkmal Wertedarstellung",
        "text": "GridScore kann jetzt die Werte für ein einzelnes Merkmal für alle Pflanzen/Beete direkt in der Datenansicht anzeigen. Um dies zu nutzen, klicke auf 'Merkmalssichtbarkeit' und dann auf 'Einzelner Wert'. Jetzt kann zwischen einzelnen Merkmalen gewechselt werden um deren Werte direkt im Feldplan anzuzeigen."
      },
      {
        "type": "update",
        "title": "Besseres Scannen von QR-Codes/Barcodes",
        "text": "Wir haben Programmbibliotheken für das Scannen von QR-Codes/Barcodes gewechselt. Die neue Bibliothek unterstützt mehrere Typen an Codes und sollte auch schneller beim Scannen sein als die alte Bibliothek."
      },
      {
        "type": "new",
        "title": "Mehrere Einträge zu einer Studie hinzufügen",
        "text": "Es ist jetzt möglich mehrere Einträge auf einmal zu einer Studie hinzuzufügen statt dies einzeln zu tun."
      },
      {
        "type": "bugfix",
        "title": "Fehlerbehebung beim Sammeln von Mehrfachmarkmalsdaten",
        "text": "In vorherigen Versionen war ein Fehler enthalten der auftrat wenn ein Mehrfachmerkmal bewertet wurde während gleichzeitig andere Merkmale ausgeblendet waren. Dies resultierte in korrupten Daten, wurde aber hiermit behoben."
      }
    ]
  },
  {
    "version": "1.13.0",
    "date": "2022-11-14",
    "items": [
      {
        "type": "new",
        "title": "Rep-Unterstützung",
        "text": "GridScore unterstützt jetzt Rep-Nummern. Dafür wurde eine neue Schaltfläche zum Setup hinzugefügt in dem die Keimplasmaidentifikatoren und Rep-Nummern definiert werden. Reps sind optional außer wenn sie nötig sind um zwischen Beeten mit gleichem Keimplasmaidentifikator zu unterscheiden."
      },
      {
        "type": "new",
        "title": "Shapefile-Export",
        "text": "Falls die Versuchseckpunkte definiert sind kann GridScore jetzt ein Germinate-kompatibles Shapefile generieren. Dieses kann dann direkt zu Germinate hochgeladen werden um die einzelnen Beetformen zu definieren."
      },
      {
        "type": "new",
        "title": "Visualisierung von numerischen Mehrfach-Merkmalen",
        "text": "Eine neue Visualisierung für numerische Mehrfach-Merkmale wurde hinzugefügt um die Entwicklung der Merkmalswerte über die Zeit darzustellen. Dies ist besonders nützlich um den Einfluss der Zeitkomponente auf die Werte von Merkmalen wie Krankheitsresistenz, Pflanzengröße und Ertrag zu erkennen."
      },
      {
        "type": "bugfix",
        "title": "Entfernen von numerischen Merkmalswerten",
        "text": "Es war zuvor nicht möglich den Wert eines numerischen Merkmals komplett zu entfernen. Dies wurde in dieser Version behoben."
      }
    ]
  },
  {
    "version": "1.14.0",
    "date": "2023-01-24",
    "items": [
      {
        "type": "new",
        "title": "Nicht zusammengerechnete Mehrfachmessungen für Export zu Germinate",
        "text": "Bisher musst beim Exportieren von Mehrfachmessungen in die Germinate Datenvorlagen immer eine Zusammenrechnungsmethode gewählt werden. Dies musste eine dieser Optionen sein: Durchschnitt, Summe oder zuletzt gemessener Wert. Jetzt können alle aufgezeichneten Werte individuell exportiert werden durch das Abwählen einer Zusammenrechnungsmethode. Dies resultiert in einer Datei die alle einzelnen Messungen enthält."
      },
      {
        "type": "new",
        "title": "Heatmap-Zeitreihen-Diagramm",
        "text": "Für Mehrfachmessungen ist es jetzt möglich sich alle aufgezeichneten Werte über die Zeit in Form einer Heatmap anzeigen zu lassen. Um dies zu erreichen haben wir eine neue Darstellungsoption hinzugefügt die 'Zeitreihe' heißt. Diese aktiviert einen Zeit-Schieberegler um den dargestellten Zeitpunkt zu ändern und zu sehen wie die Mehrfachmessungen sich über die Zeit verhalten."
      }
    ]
  },
  {
    "version": "1.15.0",
    "date": "2023-02-10",
    "items": [
      {
        "type": "new",
        "title": "BrAPI-Export nach Germinate",
        "text": "GridScore unterstützt jetzt den Export von Versuchsdaten nach Germinate via BrAPI. Um diese Funktionalität zu nutzen, gehe zum Export-Bereich und wähle den BrAPI Reiter aus. Ein gültiges Germinate-Token ist erforderlich zum Hochladen und man muss mindestens die 'Data curator'-Berechtigungen in Germinate haben."
      }
    ]
  },
  {
    "version": "2.0.2",
    "date": "2023-07-21",
    "items": [
      {
        "type": "new",
        "title": "GridScore NEXT Veröffentlichung",
        "text": "Hiermit veröffentlichen wir die neue Version von GridScore mit dem Namen GridScore NEXT. Dies ist ein großer Schritt voraus und wir haben einige Veränderungen vorgenommen daran wie GridScore im Hintergrund arbeitet. Mehr Informationen über die meisten Veränderungen befinden sich unten."
      },
      {
        "type": "new",
        "title": "Merkmalssatzgröße",
        "text": "In vielen Versuchen werden mehrere Individuen pro Beet/Topf bewertet. Um dies zu ermöglichen haben wir Merkmalssatzgrößen eingeführt. Die Satzgröße bestimmt wie viele einzelne Messungen pro Beet/Topf pro Satz genommen werden. Wenn man also drei Pflanzen pro Beet/Topf bewertet, dann sollte die Satzgröße auf 3 gesetzt werden."
      },
      {
        "type": "new",
        "title": "Markmalszeitspannen",
        "text": "Oft werden Merkmale in einem bestimmten Zeitraum aufgezeichnet. Um alle darauf hinzuweisen haben wir Merkmalszeitspannen eingeführt die angeben wann Bewertungen von bestimmten Merkmalen aufgezeichnet werden sollten oder müssen. Ein hilfreiches Diagramm weist auf die Zeitspannen hin."
      },
      {
        "type": "new",
        "title": "Merkmalsgruppierungen",
        "text": "Um die Benutzeroberfläche klarer zu halten, aber auch um mehrere Merkmale auf einmal ein-/auszublenden haben wir Merkmalsgruppen eingeführt. Diese Gruppen können genutzte werden um Gruppierungen an Merkmalen zu erstellen die bestimmte Eigenschaften teilen, wir zum Beispiel den Zeitraum, ob sie physiologische Merkmale sind oder jegliche andere Charakteristika ."
      },
      {
        "type": "new",
        "title": "Teilungsberechtigungen",
        "text": "Im alten GridScore durfe jeder, sobald ein Versuch geteilt wurde, diesen Versuch bearbeiten und Merkmale hinzufügen. In dieser neuen Version werden drei verschiedene Teilungs-QR-Codes angezeigt die unterschiedliche Berechtigungen erteilen. Auf der Teilungsseite gibt es mehr Informationen über die einzelnen Berechtigungen, aber kurz gezeigt sind sie: 'Besitzer', 'Editor' und 'Betrachter'."
      },
      {
        "type": "new",
        "title": "Verbesserter Versuchsaufbau",
        "text": "Wir haben den Aufbau der Versuche verbessert indem wir die Benutzeroberfläche in kleinere Bereiche aufgeteilt haben sowie neue Funktionalitäten hinzugefügt haben. Versuche und Merkmale können jetzt Beschreibungen erhalten. Keimplasmainformationen können jetzt in mehr Formaten importiert werden inklusive des FielDHub Formats und Andere. Merkmale, sobald dem Aufbau hinzugefügt, können bearbeitet und umsortiert werden. Die gesamte Merkmalsliste kann importiert und exportiert werden im GridScore und Germinate Format."
      },
      {
        "type": "new",
        "title": "Mehr Beispieldatensätze",
        "text": "Um die neuen Funktionalitäten hervorzuheben haben wir neue Beispieldatensätze hinzugefügt und alte aktualisiert. Versuch sie doch mal aus indem du einen der Beispieldatensätze lädst."
      },
      {
        "type": "new",
        "title": "Teilen von Einstellungen",
        "text": "Die allgemeinen GridScore Einstellungen können jetzt mithilfe eines QR-Codes geteilt werden. Dies macht es deutlich einfacher die gleichen Einstellungen auf allen Geräten zu nutzen."
      },
      {
        "type": "new",
        "title": "Bearbeitunge existierender Versuche",
        "text": "Es ist jetzt möglich bestimmte Eigenschaften eines existierenden Versuchs zu bearbeiten: Name, Beschreibung, Eckpunkte und visuelle Markierungen."
      },
      {
        "type": "new",
        "title": "Versuch kopieren",
        "text": "Falls eine Kopie eines existierenden Versuches erstellt werden soll, gibt es nun die Möglichkeit einen Versuch direkt zu kopieren oder Änderungen dabei vorzunehmen um einen neuen Versuch zu erstellen."
      },
      {
        "type": "new",
        "title": "Replikat-Heatmap",
        "text": "Eine neue Visualisierung wurde in Form eine Replikat-Heatmap hinzugefügt. Falls Replikate im Versuch vorhanden sind, kann somit die Varianz innerhalb eines Keimplasmas untersucht werden und potentielle Fehler gefunden werden."
      },
      {
        "type": "new",
        "title": "Mehrere Kommentare",
        "text": "Es ist jetzt möglich mehrere Kommentare sowohl zum Versuch als auch einzelnen Beeten hinzuzufügen. Der Zeitpunkt des Kommentars wird dabei aufgezeichnet um immer zu wissen wann ein Kommentar hinzugefügt wurde."
      },
      {
        "type": "new",
        "title": "Versuchsarchivierung",
        "text": "Geteilte Versuche werden vom GridScore Server nach einer Periode der Inaktivität archiviert. GridScore wird frühzeitig eine Benachrichtungung anzeigen um genug Zeit zum Exportieren oder Erneuern zu lassen. Nachdem ein Versuch archiviert wurde, kann er immernoch als Paket heruntergeladen werden."
      },
      {
        "type": "update",
        "title": "Existierende Daten importieren",
        "text": "Der Vorgang des Importierens von existierenden Daten wurde angepasst um mehr Flexibilität zu bieten."
      },
      {
        "type": "update",
        "title": "Bessere Synchronisation",
        "text": "Wir haben viel Zeit darein investiert die Synchronisation zwischen Geräten zu verbessern. Wir nutzen nun ein Transaktionssystem wo jede Veränderung als eine eigene Einheit übermittelt wird was es dem Server erleichtert diese zu synchronisieren. Dies führt auch dazu, dass wir nun eine Übersicht vor dem Synchronisieren anzeigen können."
      },
      {
        "type": "update",
        "title": "Versionsaktualisierungen",
        "text": "Wenn eine neue Version von GridScore veröffentlicht wird, zeigt GridScore jetzt eine Benachrichtigung an und fordert zum Aktualisieren auf. Dies macht es offensichtlicher wenn eine neue Version verfügbar ist."
      },
      {
        "type": "bugfix",
        "title": "Zeitzonen-Probleme",
        "text": "Bisher konnte es vorkommen, dass Zeitzonen-Probleme beim Darstellen oder Exportieren von Daten auftraten. Dies lag an der Art und Weise in der Daten gespeichert wurden und ist jetzt behoben dadurch, dass GridScore UTC-Zeitpunkte speichert."
      }
    ]
  },
  {
    "version": "2.1.0",
    "date": "2023-08-31",
    "items": [
      {
        "type": "new",
        "title": "Datendarstellungs-Konfiguration",
        "text": "Wir haben Konfigurationsoptionen für die Haupt-Datenanzeige hinzugefügt. Diese beinhalten andere Symbole für Datenpunkte, Anpassung der Größe und Dichte welche es erlauben eine kompaktere oder gelockerte Darstellung zu wählen."
      },
      {
        "type": "update",
        "title": "Bildertagging auf iOS",
        "text": "Wir haben ein Banner hinzugefügt welches auf iOS Geräten darauf hinweist, dass ein zusätzlicher Schritt beim Speichern von Bildern nötig sein kann, da iOS den Download von Bildern anders handhabt als andere Betriebssysteme."
      },
      {
        "type": "bugfix",
        "title": "Betrachtercode Probleme",
        "text": "Es gab Probleme mit Betrachterberechtigungen wo es Betrachtern nicht möglich war Änderungen vom Server zu laden. Dies wurde behoben."
      }
    ]
  },
  {
    "version": "2.2.0",
    "date": "2023-10-04",
    "items": [
      {
        "type": "new",
        "title": "Versuchsgruppen",
        "text": "Es ist jetzt möglich Versuche in Gruppen zu organisieren. Diese Gruppen können während des Aufbaus, beim Importieren oder zu einem späteren Zeitpunkt zugewiesen werden."
      }, {
        "type": "new",
        "title": "Versuchsmerkmalimport",
        "text": "Beim Erstellen eines neuen Versuches können jetzt Merkmale aus einem anderen Versuch importiert werden der auf dem aktuellen Gerät verfügbar ist."
      }, {
        "type": "new",
        "title": "Nicht-gemittelter Datenexport",
        "text": "Beim Exportieren von Versuchsdaten kann jetzt das Mitteln über Wertsätze und den gleichen Tag deaktiviert werden."
      }, {
        "type": "new",
        "title": "Homepage-Ordnung",
        "text": "Es kann jetzt die Anordnung der Elemente auf der Homepage geändert werden."
      }, {
        "type": "update",
        "title": "Gelenkter Ablaub Änderung",
        "text": "Um sowohl den verfügbaren Bildschirmbereich als auch die Leistung zu maximieren haben wir den gelenkten Ablauf auf eine eigenständige Seite verlagert wo er den maximalen Bildschirmbereich ausnutzen kann."
      }, {
        "type": "bugfix",
        "title": "BrAPI Probleme",
        "text": "Es gab ein paar Problemen mit der BrAPI-Funktionalität sowohl für das Importieren von Merkmalen als auch das Exportieren von Daten. Diese Probleme sind jetzt behoben."
      }
    ]
  },
  {
    "version": "2.3.0",
    "date": "2023-11-09",
    "items": [
      {
        "type": "new",
        "title": "Versuchsaufwertung",
        "text": "Wir haben bessere Handhabung von Situationen wo Versuche via Code importiert werden die bereits auf dem Gerät existieren. Basierend auf den Berechtigungen des geteilten Versuchs und des lokalen werden Benutzern Optionen zum Aufwerten ihres lokalen Versuches oder der Import einer neuen, unabhängigen Kopie angeboten."
      },
      {
        "type": "new",
        "title": "Diagramm-Datenpunktauswahl",
        "text": "Wir haben Unterstützung für die Auswahl von Datenpunkten zu Heatmaps und Boxplots hinzugefügt. Wenn ausgewählt, zeigt ein Dialogfenster die Datenpunkte für das ausgewählte Beet, Rep und Merkmal an."
      },
      {
        "type": "update",
        "title": "Versuchs-Teilstatus",
        "text": "Eine Angabe zum Versuchs-Teilstatus wurde zur Versuchsinformation hinzugefügt. Dies zeigt an ob man der 'Besitzer', 'Editor' oder 'Betrachter' für diesen Versuch ist."
      },
      {
        "type": "update",
        "title": "Bilddateiname",
        "text": "Der Versuchsname (oder eher eine kompakte Version davon) wurde zum Anfang des Dateinamens von Bildern die mit GridScore aufgezeichnet werden hinzugefügt."
      },
      {
        "type": "update",
        "title": "Versuchsinformations-Dropdown",
        "text": "Das Versuchsinformations-Dropdown welches zuvor auf der Dateneingabe angezeigt wurde ist nun in der Hauptnavigationsleiste zu finden um es auf mehr Seiten verfügbar zu machen. Es wird nicht angezeigt auf Seiten die nicht zu einem bestimmten Versuch gehören wie die Startseite und die Einstellungsseite."
      },
      {
        "type": "bugfix",
        "title": "Löschen von Versuchskommentaren",
        "text": "Ein Problem beim Löschen von Versuchskommentaren wurde behoben."
      }
    ]
  },
  {
    "version": "2.4.0",
    "date": "2023-11-20",
    "items": [
      {
        "type": "new",
        "title": "Mehr Ordnungen für gelenkten Ablauf",
        "text": "Zusätzlich zu den originalen 8 Ordnungen haben wir weitere 8 hinzugefügt. Während die originalen einen immer zurück gegen die Richtung aus der man kam geleitet haben damit man Beete auf dem Rückweg bewerten kann, springen die neuen zurück zum Anfang um von dort neu anzufangen. Dies erlaubt es alle Beete aus der gleichen Perspektive zu bewerten was in manchen Situationen, wie extremen Lichtverhältnissen, nützlich sein kann."
      },
      {
        "type": "update",
        "title": "Keimplasmaduplikat-Warnung",
        "text": "Während GridScore bisher das Erstellen eines Versuches verhindert hat der Duplikate von Keimplasma-Rep-Identifikatoren beinhaltet, haben wir festgestellt, dass  es manchmal nötig sein kann dies zu erlauben. GridScore wird nun eine Warnung statt eines Fehlers anzeigen welche vom Nutzer akzeptiert werden muss bevor fortgefahren werden kann++."
      },
      {
        "type": "bugfix",
        "title": "Importieren von Versuchs-Teilcodes",
        "text": "Fehler beim importieren von Teilcodes behoben wo fälschlicherweise eine Übereinstimmung mit einem lokalen Versuch angezeigt wird."
      }
    ]
  },
  {
    "version": "2.4.1",
    "date": "2023-11-21",
    "items": [
      {
        "type": "new",
        "title": "Vietnamesische Übersetzung",
        "text": "Dank unseres Kollaborateurs Huu Loi Nguyen haben wir eine vietnamesische Übersetzung zu GridScore hinzugefügt."
      }
    ]
  },
  {
    "version": "2.5.0",
    "date": "2024-01-22",
    "items": [
      {
        "type": "new",
        "title": "Keimplasmaauswahl",
        "text": "Auf der Statistikseite kann nun eine Teilmenge des Keimplasmas ausgewählt werden um es gegen den Rest der Daten hervorzuheben und eine bessere Ansicht auf dessen Leistung zu geben."
      },
      {
        "type": "new",
        "title": "Versuchsauswahl-Sortierung",
        "text": "Option hinzugefügt zum Sortieren der Versuche in der Versuchsauswahl um das Finden des eigenen Versuches zu vereinfachen."
      },
      {
        "type": "new",
        "title": "Teilen von Fotos auf Social-Media",
        "text": "Fotos können jetzt direkt auf Social-Media geteilt werden. Der Inhalt von sozialen Posts kann als Teil des Versuchs vordefiniert werden."
      },
      {
        "type": "new",
        "title": "Vereinfachte Synchronisierung",
        "text": "Es wurde ein Synchronisierungs-Knopf direkt zur Dateneingabe hinzugefügt um schneller und einfacher synchronisieren zu können ohne wieder zur Startseite zurück gehen zu müssen."
      },
      {
        "type": "update",
        "title": "Versuchsimport via QR-Code",
        "text": "Der Ablauf des Imports von Versuchen via QR-Code wurde umgebaut um die User-Erfahrung zu verbessern. Bessere Rückmeldungen wurden hinzugefügt und wichtige Nutzeroberflächenelemente werden nun automatisch in den Blick gerückt."
      }
    ]
  },
  {
    "version": "2.5.1",
    "date": "2024-02-16",
    "items": [
      {
        "type": "new",
        "title": "Externer Versuchsimport",
        "text": "GridScore kann nun Versuche basieren an URL-Parametern importieren. Der Haupt-Anwendungsfall ist die Versuchserstellung von Germinate mithilfe von FielDHub."
      },
      {
        "type": "bugfix",
        "title": "Merkmalsimport",
        "text": "Behebt einen Fehler beim Importieren von Merkmalen aus anderen bereits existierenden Versuchen."
      },
      {
        "type": "bugfix",
        "title": "Keimplasmaauswahl",
        "text": "Behebt einen Fehler bei der Keimplasmaauswahl auf der Statistikseite."
      }
    ]
  },
  {
    "version": "2.5.2",
    "date": "2024-02-28",
    "items": [
      {
        "type": "update",
        "title": "Hervorhebung von Dateneingabefehlern",
        "text": "Die Dateneingabe scrollt nun zum ersten Fehler in der Eingabe wenn ein Fehler gefunden wurde. Dies sollte Nutzen bei der Identifikation von Fehlern helfen."
      },
      {
        "type": "update",
        "title": "Diagramminteraktionen deaktiviert",
        "text": "Diagramminteraktionen sind nun standardmäßig deaktiviert. Sie können durch Umschalten des Schalters in der Nähe des Diagramms aktiviert werden."
      },
      {
        "type": "bugfix",
        "title": "Versuchsortung",
        "text": "Ein Fehler beim Synchronisieren von aufgezeichneten GPS-Informationen wurde behoben. Diese konnten zuvor verloren gehen."
      }
    ]
  },
  {
    "version": "2.5.3",
    "date": "XXXX-XX-XX",
    "items": [
      {
        "type": "new",
        "title": "Wert in Bereich Datentyp",
        "text": "Ein neuer Datentyp wurde hinzugefügt. Der 'Wert in Bereich' Datentyp lässt die Auswahl eines Wertes zwischen Minimum und Maximum mithilfe eines Schiebereglers zu. Dies erlaubt die schnellere Auswahl des korrekten Wertes. Ein gutes Anwendungsbeispiel ist eine Prozentauswahl für etwas wie 'Lagerung' wo schnell ein Prozentwert zwischen 0 und 100 ausgewählt werden kann."
      },
      {
        "type": "new",
        "title": "Versuchsereignisse",
        "text": "Versuchsereignisse wurden hinzugefügt. Zeichne Informationen über Wetterereignisse und Bewirtschaftungsereignisse (z.B. Pestizidanwendung) als Versuchsereignisse auf."
      }
    ]
  }
]