[
  {
    "version": "1.11.0",
    "date": "2022-07-12",
    "items": [
      {
        "type": "new",
        "title": "Data synchronization",
        "text": "GridScore is now able to synchronize data collected on different devices for the same trial. Data will be joined by prioritizing data with a newer recording date."
      },
      {
        "type": "new",
        "title": "Germinate export",
        "text": "When exporting data containing multi-traits to Germinate Data Templates, an aggregation method has to be chosen per trait."
      },
      {
        "type": "new",
        "title": "Surveys",
        "text": "GridScore now supports another type of dataset, namely Surveys. These are designed to support free data collection which is not physically located in a grid-like fashion."
      },
      {
        "type": "new",
        "title": "Dataset comments",
        "text": "It's now possible to add general comments to the whole trial. Use the wee comment icon next to the trial name on the data screen."
      },
      {
        "type": "update",
        "title": "Data circles",
        "text": "Trait data circles for multi-traits now show a half-filled circle when the trait has been scored at least once."
      },
      {
        "type": "bugfix",
        "title": "Speech synthesis",
        "text": "Fixed a bug with the speech synthesis which would sometimes cause text to be skipped."
      }
    ]
  }, {
    "version": "1.12.0",
    "date": "2022-08-12",
    "items": [
      {
        "type": "new",
        "title": "Single trait value display",
        "text": "GridScore can now show you the value of a single trait for all plants/plots right in the data view. To try this out, select the 'Trait visibility' dropdown menu and then select 'Single value'. You are then able to switch between individual traits to see their values right in the field plan."
      },
      {
        "type": "update",
        "title": "Better QR-code/barcode scanning",
        "text": "We switched to a new library for QR-code/barcode scanning. This new library has better support for a variety of barcodes and should also scan codes quicker than the old library."
      },
      {
        "type": "new",
        "title": "Adding multiple entries to a survey",
        "text": "You'll now be able to add multiple entries to a survey at the same time rather than adding them individually."
      },
      {
        "type": "bugfix",
        "title": "Bug fix for multi-trait scoring",
        "text": "In previous versions there was a bug that happened when scoring multi-traits while also having some traits toggled. This would result in corrupted data and has now been corrected."
      }
    ]
  },
  {
    "version": "1.13.0",
    "date": "2022-11-14",
    "items": [
      {
        "type": "new",
        "title": "Rep support",
        "text": "GridScore now supports rep numbers in the trial setup. For this purpose, a new germplasm identifier and rep screen has been added. Reps are completely optional unless the same germplasm identifier has been used multiple times, in which case the rep needs to be used to differentiate between them."
      },
      {
        "type": "new",
        "title": "Shapefile export",
        "text": "If the corner points of a trial have been defined, GridScore can generate a Germinate-compatible Shapefile which can then be directly uploaded to Germinate to define the individual plot shapes."
      },
      {
        "type": "new",
        "title": "Numeric multi-trait visualization",
        "text": "A new visualization for numeric multi-traits has been added that shows the value development over time. This is particularly useful to see if there are any temporal effects on trait values like disease resistance, plant height or yield."
      },
      {
        "type": "bugfix",
        "title": "Numeric data point removal",
        "text": "It was previously impossible to remove the value of a numeric trait. This has been fixed in this release."
      }
    ]
  },
  {
    "version": "1.14.0",
    "date": "2023-01-24",
    "items": [
      {
        "type": "new",
        "title": "Non-aggregated multi-trait export to Germinate",
        "text": "Until now whenever exporting multi-trait data into the Germinate data templates, an aggregation method per multi-trait had to be selected. This was one of these options: average, sum or last recorded value. You can now export all individual data points for a multi-trait by de-selecting the aggregation during export. This will result in a file containing all individual measurements."
      },
      {
        "type": "new",
        "title": "Heatmap timeline chart",
        "text": "For multi-traits it's now possible to to look at all recorded values over time in the form of a heatmap. For this purpose, we added a new visualization option called 'Show timeline' which will activate a time slider to move through time and see how the multi-trait changed over time."
      }
    ]
  },
  {
    "version": "1.15.0",
    "date": "2023-02-10",
    "items": [
      {
        "type": "new",
        "title": "BrAPI export to Germinate",
        "text": "GridScore now supports export of trials data to Germinate via BrAPI. To use this feature, go to the export section of a trial and then select the 'BrAPI' tab. You'll need to have a valid Germinate API token to upload data and you have to have at least 'Data Curator' permissions."
      }
    ]
  },
  {
    "version": "2.0.2",
    "date": "2023-07-21",
    "items": [
      {
        "type": "new",
        "title": "GridScore NEXT release",
        "text": "This marks the release of the new version of GridScore called GridScore NEXT. This is a major step forwards and we have made major changes to the way GridScore operates in the background. Details on most of the changes can be found below."
      },
      {
        "type": "new",
        "title": "Trait set sizes",
        "text": "In a lot of trial scenarios you'll be scoring multiple individuals per plot/pot. To facilitate this, we have introduced trait set sizes. The set size determines how many individual measurements per plot/pot are made within each set. So if you are scoring three plants per plot/pot, set the set size to 3."
      },
      {
        "type": "new",
        "title": "Trait time frames",
        "text": "Often specific traits need to be or should be scored within a certain time period. To make everyone aware of this fact, we have introduced trait time frames that specify when data for a trait should or has to be scored. A helpful graph will show you the time frame of each trait."
      },
      {
        "type": "new",
        "title": "Trait groups",
        "text": "To declutter the interface, but also to allow toggling multiple traits at the same time, trait groups have been added. These groups can be used to create sets of traits that share characteristics like the time frame when they are scored or whether they are physiological traits or any other characteristic."
      },
      {
        "type": "new",
        "title": "Sharing permissions",
        "text": "In the old version of GridScore, once you shared a trial, everyone was able to add and change data as well as traits. In the new version when you share a trial you'll be given three different sharing codes, each one granting specific permissions on the trial. There's more information on the sharing screen, but basically, the permissions types are 'Owner', 'Editor' and 'Viewer'."
      },
      {
        "type": "new",
        "title": "Improved setup",
        "text": "We have streamlined the process of trial creation by splitting the user interface into more digestible chunks as well as adding more functionality. Trials and traits can now have a description. Germplasm information about the trial can be imported from more formats including the output from FielDHub and other tools. Traits, once added to the setup, can be modified and reordered. The whole list of traits can now be exported and imported in GridScore and Germinate format."
      },
      {
        "type": "new",
        "title": "More example datasets",
        "text": "To highlight the new features outlined here, we have introduced new example datasets and updated existing ones. Why not try them out by loading one of the example datasets?"
      },
      {
        "type": "new",
        "title": "Settings sharing",
        "text": "You can now share the generic GridScore settings between devices using a QR code. This makes it easy to have the same settings setup on all devices that will be used."
      },
      {
        "type": "new",
        "title": "Editing an existing trial",
        "text": "There is now a way to edit/change specific properties of a trial like the name, description, corner points and visual markers."
      },
      {
        "type": "new",
        "title": "Duplicate a trial",
        "text": "If you want to create a new trial based on a different existing trial, there's now a trial duplication feature that allows you to copy (but also modify) the setup of that other trial to create a new separate trial."
      },
      {
        "type": "new",
        "title": "Replicate heatmap",
        "text": "A new visualization has been added in the form of a replicate heatmap. If you're using a replicated trial, you can now look at the variation within a germplasm and across the reps to identify potential errors in your data."
      },
      {
        "type": "new",
        "title": "Multiple comments",
        "text": "It is now possible to add multiple comments to the trial and each individual plot. Each comment is timestamped so you always know when something has been recorded."
      },
      {
        "type": "new",
        "title": "Trial archiving",
        "text": "Shared trials will be archived by the GridScore server after a period of inactivity. GridScore will notify you well in advance of the expiration date to give you enough time to export your trial or renew the trial. Once archived, the whole trial can still be downloaded as a package."
      },
      {
        "type": "update",
        "title": "Import existing data",
        "text": "The way existing data is imported into a trial has changed to offer more flexibility."
      },
      {
        "type": "update",
        "title": "Better synchronization",
        "text": "We have invested a lot of time into improving the data synchronization between devices. We now utilise a transaction-based system where each change you make is synchronized as a distinct unit making it much easier for the server to integrate these changes. It also gives you an overview of the changes you have made before synchronising them."
      },
      {
        "type": "update",
        "title": "Version updates",
        "text": "Whenever a new version of GridScore is released, the app will notify you of the new version and ask you to update and refresh making it more obvious that a new version is available."
      },
      {
        "type": "bugfix",
        "title": "Timezone issues",
        "text": "Previously, due to the way the old GridScore stored dates, there were timezone issues when displaying and exporting data. These have been resolved in this version as we're now storing UTC timestamps."
      }
    ]
  },
  {
    "version": "2.1.0",
    "date": "2023-08-31",
    "items": [
      {
        "type": "new",
        "title": "Data display configuration",
        "text": "We have added options to configure the main data display. These include changing the circles to squares, adjusting the size of the data points as well as their density to allow for more compact or relaxed displays."
      },
      {
        "type": "update",
        "title": "Image tagging iOS",
        "text": "We have added a notification banner on iOS devices to the image tagging as iOS handles the download of images differently to any other OS. An additional step may be required to actually save the images."
      },
      {
        "type": "bugfix",
        "title": "Viewer code issues",
        "text": "There was an issue with trial viewer permissions where a viewer wasn't able to load remote changes to a trial. This has been resolved."
      }
    ]
  },
  {
    "version": "2.2.0",
    "date": "2023-10-04",
    "items": [
      {
        "type": "new",
        "title": "Trial groups",
        "text": "It is now possible to organize trials into groups. These groups can be assigned during setup, import or at any point afterwards."
      }, {
        "type": "new",
        "title": "Trial trait import",
        "text": "When setting up a new trial you can now import trials from another trial that's available on your current device."
      }, {
        "type": "new",
        "title": "Non-averaged data export",
        "text": "When exporting trials data you can now disable averaging of values across sets and on the same day."
      }, {
        "type": "new",
        "title": "Home page order",
        "text": "You can now change the order of the home page widgets from the settings page."
      }, {
        "type": "update",
        "title": "Guided walk change",
        "text": "To maximize the available screen space as well as performance, we have moved the guided walk to its own page where it will use all the available screen space."
      }, {
        "type": "bugfix",
        "title": "BrAPI issues",
        "text": "There were some issues with the BrAPI functionality both for importing traits as well as exporting data. These have been resolved."
      }
    ]
  },
  {
    "version": "2.3.0",
    "date": "2023-11-09",
    "items": [
      {
        "type": "new",
        "title": "Trial upgrade",
        "text": "We've added better handling of cases where an already existing trial is imported via a share code again. Depending on the local permissions and the new shared ones, users will be able to either upgrade their permissions or import the trial as a new, independent copy."
      },
      {
        "type": "new",
        "title": "Plot data point selection",
        "text": "We've added support for data point selection events to the heatmap and box plot visualizations. When selected, a popup will show the data point values for the selected plot, rep and trait."
      },
      {
        "type": "update",
        "title": "Trial share status",
        "text": "An indication of the trial share status has been added to the trial information. This will show you whether you have 'owner', 'editor' or 'viewer' permissions on the trial."
      },
      {
        "type": "update",
        "title": "Image filename",
        "text": "The trial name (or rather a compact version of it) has been added to the start of the filename of images that are recorded using GridScore."
      },
      {
        "type": "update",
        "title": "Trial information dropdown",
        "text": "The trial information dropdown box that was shown on the data input page has now been moved to the main navigation bar so it's available on more pages. It will not be shown on generic pages that aren't related to any particular trial like the home page or settings page."
      },
      {
        "type": "bugfix",
        "title": "Trial comment deletion",
        "text": "Fixed a bug where it wasn't possible to delete a trial comment."
      }
    ]
  },
  {
    "version": "2.4.0",
    "date": "2023-11-20",
    "items": [
      {
        "type": "new",
        "title": "More guided walk orders",
        "text": "In addition to the original 8 guided walk orders, we have added another 8. While the originals were always guiding you back against the direction you came from so you could score plots on the way back, the new ones let you skip back to the start and continue from there. This allows you to score all plots from the same perspective which may be useful in certain situations like extreme lighting conditions."
      },
      {
        "type": "update",
        "title": "Duplicate germplasm warning",
        "text": "While so far, GridScore prevented you from creating a trial that contained duplicate germplasm-rep combinations, we realized that it may be useful to allow these. GridScore will now show a warning instead of an error, which the user has to accept before continuing."
      },
      {
        "type": "bugfix",
        "title": "Trial share code import",
        "text": "Fixed a bug where importing a share code would falsely report a local match where there isn't one."
      }
    ]
  },
  {
    "version": "2.4.1",
    "date": "2023-11-21",
    "items": [
      {
        "type": "new",
        "title": "Vietnamese translation",
        "text": "Thanks to our collaborator Huu Loi Nguyen, we have now added a Vietnamese translation to GridScore."
      }
    ]
  },
  {
    "version": "2.5.0",
    "date": "2024-01-22",
    "items": [
      {
        "type": "new",
        "title": "Germplasm selection",
        "text": "On the trait statistics page you can now select specific germplasm to highlight against the rest of the data giving you a better idea of their performance."
      },
      {
        "type": "new",
        "title": "Trial selector sorting",
        "text": "Added options for sorting of trials in the trial selector to more easily find your trial."
      },
      {
        "type": "new",
        "title": "Photo social media sharing",
        "text": "You can now share images you've taken directly to social media. Social post contents can be pre-defined as part of the trial."
      },
      {
        "type": "new",
        "title": "Easier synchronization",
        "text": "We added a synchronization button to the top of the data input page so you can access it straight from there without having to go back to the home page first."
      },
      {
        "type": "update",
        "title": "Trial QR code import",
        "text": "The workflow of importing a trial using a QR code has been reworked to improve the user experience. Better feedback has been added and important user interface elements are automatically scrolled into view."
      }
    ]
  },
  {
    "version": "2.5.1",
    "date": "2024-02-16",
    "items": [
      {
        "type": "new",
        "title": "External trial import",
        "text": "GridScore now supports importing a trial via a URL link. The main use-case is currently the trial creation from Germinate via FielDHub."
      },
      {
        "type": "bugfix",
        "title": "Trait import",
        "text": "Fixed an issues when importing traits from another existing trial."
      },
      {
        "type": "bugfix",
        "title": "Germplasm selection",
        "text": "Fixed an issues with germplasm selection in statistical plots."
      }
    ]
  },
  {
    "version": "2.5.2",
    "date": "2024-02-28",
    "items": [
      {
        "type": "update",
        "title": "Data input error highlight",
        "text": "The data input will now scroll to the first error in the data input if an error is detected. This will help users identify errors in their data input more easily."
      },
      {
        "type": "update",
        "title": "Disabled chart interaction",
        "text": "Chart interactions are now disabled by default. They can be enabled by using the switch-toggle button next to the data visualization."
      },
      {
        "type": "bugfix",
        "title": "Trial geolocation",
        "text": "Fixed an issues where recorded geolocations (GPS locations) are lost when synchronizing a shared trial."
      }
    ]
  },
  {
    "version": "2.5.3",
    "date": "2024-03-12",
    "items": [
      {
        "type": "new",
        "title": "Value in range data type",
        "text": "A new data type has been added. The 'value in range' type will let you choose a value between the minimum and maximum using a range slider control. This allows faster selection of the correct value. A good use-case is a percentage slider for things like 'lodging' where you can quickly select a value between 0 and 100."
      },
      {
        "type": "new",
        "title": "Trial events",
        "text": "Trial events have been added. Record information about weather events or trial management (e.g. pesticide application) as a trial event."
      },
      {
        "type": "update",
        "title": "Trial selector visuals",
        "text": "The trial selector cards have changed slightly. Instead of showing the items as a list, they're now displayed as a grid of elements."
      },
      {
        "type": "update",
        "title": "Replicate heatmap",
        "text": "Removed the replicate heatmap for those trials where replicates are defined, but they are all unique, so not actual replicates. Before this generated a huge and empty and therefore rather useless heatmap."
      }
    ]
  },
  {
    "version": "2.6.0",
    "date": "2024-05-15",
    "items": [
      {
        "type": "new",
        "title": "Control/check plots",
        "text": "You can now define plots as control/check plots during trial setup. This will highlight them on the data input screen as well as on any data visualization so you can compare the rest of the data against the controls/checks."
      },
      {
        "type": "new",
        "title": "Trial people",
        "text": "We've added support for adding individuals to a trial in the form of defining people and their role within the trial (e.g. data collector, corresponding author, etc). This will currently not affect the way GridScore behaves, but if people are defined for a trial you will have to select who is recording data. This has been put in place to allow GridScore to pre-fill data templates during data export."
      },
      {
        "type": "new",
        "title": "Data statistics",
        "text": "An overview trial statistics page has been added to GridScore that shows various views onto the data like a calendar heatmap showing busy data collection days as well as stats on the size of area covered by data collection and many others."
      },
      {
        "type": "new",
        "title": "Color palettes",
        "text": "Added a pre-selection of color palettes to choose from. These include the default GridScore palette as well as other well-known color palettes."
      },
      {
        "type": "new",
        "title": "Main display mode",
        "text": "Starting from this release, the main display of GridScore will be rendered differently for smaller trials. If you encounter any performance issues, please change the main display mode in the settings to 'Canvas only'."
      }
    ]
  }
]